In [63]:
import pandas as pd

df = pd.read_excel('./planilhas/dataEx.xlsx')
df

    Aluno  Nota P1  Nota P2   N1  Nota P3  Nota P4   N2  Resultado
0   Lucas      8.5      2.0  2.0      2.0      2.0  2.0        2.0
1   Lucas      8.5      2.0  2.0      2.0      2.0  2.0        2.0
2   Lucas      8.5      5.0  5.0      5.0      5.0  5.0        5.0
3  Felipe      9.8      8.8  8.8      8.8      8.8  8.8        8.8

In [64]:
df.drop(0, inplace=True)
df

    Aluno  Nota P1  Nota P2   N1  Nota P3  Nota P4   N2  Resultado
1   Lucas      8.5      2.0  2.0      2.0      2.0  2.0        2.0
2   Lucas      8.5      5.0  5.0      5.0      5.0  5.0        5.0
3  Felipe      9.8      8.8  8.8      8.8      8.8  8.8        8.8

In [65]:
df.groupby(['Aluno']).size()

Aluno
Felipe    1
Lucas     2
dtype: int64

In [66]:
# df.drop(df.index, inplace=True)

In [68]:
entry = df.loc[3]

df3_sim = pd.DataFrame(data=df)

df3_sim = df3_sim.append(entry)

df3_sim = df3_sim.reset_index()

df3_sim.drop(columns=['index'])

/tmp/ipykernel_9983/1385140414.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3_sim = df3_sim.append(entry)

    Aluno  Nota P1  Nota P2   N1  Nota P3  Nota P4   N2  Resultado
0   Lucas      8.5      2.0  2.0      2.0      2.0  2.0        2.0
1   Lucas      8.5      5.0  5.0      5.0      5.0  5.0        5.0
2  Felipe      9.8      8.8  8.8      8.8      8.8  8.8        8.8
3  Felipe      9.8      8.8  8.8      8.8      8.8  8.8        8.8